driver-tests/bpelse/assign/AssignJbi/test/CopyunsignedShortInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <unsignedShortPart>
	<xsd_unsignedShort>10000</xsd_unsignedShort>
	<optional_unsignedShort>7901</optional_unsignedShort>
	<repeat_unsignedShort>7901</repeat_unsignedShort>
	<repeat_unsignedShort>51</repeat_unsignedShort>
   </unsignedShortPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
